Revit 2027 API
ViewCropRegionShapeManager.CanHaveShape Property
 Verifies that the crop of the associated view is permitted to have a non-rectangular shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveShape { get; }
Public ReadOnly Property CanHaveShape As Boolean
	Get
public:
property bool CanHaveShape {
	bool get ();
}
member CanHaveShape : bool with get
Property Value
Boolean
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace